jwy8612/monitor/software/header/iom256v.h
/* GTCCR */
#define GTCCR	(*(volatile unsigned char *)0x40)
#define  TSM      7
#define  PSRASY   1
#define  PSRSYNC  0

/* Watchdog Timer Control Register */
#define WDTCSR	(*(volatile unsigned char *)0x60) /* m/m */
#define WDTCR	(*(volatile unsigned char *)0x60) /* m/m */
#define  WDIF     7
#define  WDIE     6
#define  WDP3     5
#define  WDCE     4
#define  WDE      3
#define  WDP2     2
#define  WDP1     1
#define  WDP0     0

/* OCDR */
#define OCDR	(*(volatile unsigned char *)0x51)
#define MONDR	(*(volatile unsigned char *)0x51)

/* Timer/Counter 0 */
#define OCR0B	(*(volatile unsigned char *)0x48)
#define OCR0A	(*(volatile unsigned char *)0x47)
#define TCNT0	(*(volatile unsigned char *)0x46)
#define TCCR0B	(*(volatile unsigned char *)0x45)
#define  FOC0     7
#define  FOC0A    7
#define  FOC0B    7
#define  WGM02    3
#define  CS02     2
#define  CS01     1
#define  CS00     0
#define TCCR0A	(*(volatile unsigned char *)0x44)
#define  COM0A1   7
#define  COM0A0   6
#define  COM0B1   5
#define  COM0B0   4
#define  WGM01    1
#define  WGM00    0

/* Timer/Counter1 */
#define ICR1	(*(volatile unsigned int *)0x86) /* m/m */
#define ICR1L	(*(volatile unsigned char *)0x86) /* m/m */
#define ICR1H	(*(volatile unsigned char *)0x87) /* m/m */
#define OCR1C	(*(volatile unsigned int *)0x8C) /* m/m */
#define OCR1CL	(*(volatile unsigned char *)0x8C) /* m/m */
#define OCR1CH	(*(volatile unsigned char *)0x8D) /* m/m */
#define OCR1B	(*(volatile unsigned int *)0x8A) /* m/m */
#define OCR1BL	(*(volatile unsigned char *)0x8A) /* m/m */
#define OCR1BH	(*(volatile unsigned char *)0x8B) /* m/m */
#define OCR1A	(*(volatile unsigned int *)0x88) /* m/m */
#define OCR1AL	(*(volatile unsigned char *)0x88) /* m/m */
#define OCR1AH	(*(volatile unsigned char *)0x89) /* m/m */
#define TCNT1	(*(volatile unsigned int *)0x84) /* m/m */
#define TCNT1L	(*(volatile unsigned char *)0x84) /* m/m */
#define TCNT1H	(*(volatile unsigned char *)0x85) /* m/m */
#define TCCR1C	(*(volatile unsigned char *)0x82) /* m/m */
#define  FOC1A    7
#define  FOC1B    6
#define  FOC1C    5
#define TCCR1B	(*(volatile unsigned char *)0x81) /* m/m */
#define  ICNC1    7
#define  ICES1    6
#define  WGM13    4
#define  WGM12    3
#define  CS12     2
#define  CS11     1
#define  CS10     0
#define TCCR1A	(*(volatile unsigned char *)0x80) /* m/m */
#define  COM1A1   7
#define  COM1A0   6
#define  COM1B1   5
#define  COM1B0   4
#define  COM1C1   3
#define  COM1C0   2
#define  WGM11    1
#define  WGM10    0

/* Timer/Counter2 */
#define ASSR	(*(volatile unsigned char *)0xB6) /* m/m */
#define  EXCLK    6
#define  AS2      5
#define  TCN2UB   4
#define  OCR2AUB  3
#define  OCR2BUB  2
#define  TCR2AUB  1
#define  TCR2BUB  0
#define OCR2B	(*(volatile unsigned char *)0xB4) /* m/m */
#define OCR2A	(*(volatile unsigned char *)0xB3) /* m/m */
#define TCNT2	(*(volatile unsigned char *)0xB2) /* m/m */
#define TCCR2B	(*(volatile unsigned char *)0xB1) /* m/m */
#define  FOC2A    7
#define  FOC2B    7
#define  WGM22    3
#define  CS22     2
#define  CS21     1
#define  CS20     0
#define TCCR2A	(*(volatile unsigned char *)0xB0) /* m/m */
#define  COM2A1   7
#define  COM2A0   6
#define  COM2B1   5
#define  COM2B0   4
#define  WGM21    1
#define  WGM20    0

/* Timer/Counter3 */
#define OCR3CH	(*(volatile unsigned char *)0x9D) /* m/m */
#define OCR3CL	(*(volatile unsigned char *)0x9C) /* m/m */
#define OCR3C	(*(volatile unsigned int *)0x9C) /* m/m */
#define OCR3BH	(*(volatile unsigned char *)0x9B) /* m/m */
#define OCR3BL	(*(volatile unsigned char *)0x9A) /* m/m */
#define OCR3B	(*(volatile unsigned int *)0x9A) /* m/m */
#define OCR3AH	(*(volatile unsigned char *)0x99) /* m/m */
#define OCR3AL	(*(volatile unsigned char *)0x98) /* m/m */
#define OCR3A	(*(volatile unsigned int *)0x98) /* m/m */
#define ICR3H	(*(volatile unsigned char *)0x97) /* m/m */
#define ICR3L	(*(volatile unsigned char *)0x96) /* m/m */
#define ICR3	(*(volatile unsigned int *)0x96) /* m/m */
#define TCNT3H	(*(volatile unsigned char *)0x95) /* m/m */
#define TCNT3L	(*(volatile unsigned char *)0x94) /* m/m */
#define TCNT3	(*(volatile unsigned int *)0x94) /* m/m */
#define TCCR3C	(*(volatile unsigned char *)0x92) /* m/m */
#define  FOC3A    7
#define  FOC3B    6
#define  FOC3C    5
#define TCCR3B	(*(volatile unsigned char *)0x91) /* m/m */
#define  ICNC3    7
#define  ICES3    6
#define  WGM33    4
#define  WGM32    3
#define  CS32     2
#define  CS31     1
#define  CS30     0
#define TCCR3A	(*(volatile unsigned char *)0x90) /* m/m */
#define  COM3A1   7
#define  COM3A0   6
#define  COM3B1   5
#define  COM3B0   4
#define  COM3C1   3
#define  COM3C0   2
#define  WGM31    1
#define  WGM30    0

/* Timer/Counter4 */
#define OCR4CH	(*(volatile unsigned char *)0xAD) /* m/m */
#define OCR4CL	(*(volatile unsigned char *)0xAC) /* m/m */
#define OCR4C	(*(volatile unsigned int *)0xAC) /* m/m */
#define OCR4BH	(*(volatile unsigned char *)0xAB) /* m/m */
#define OCR4BL	(*(volatile unsigned char *)0xAA) /* m/m */
#define OCR4B	(*(volatile unsigned int *)0xAA) /* m/m */
#define OCR4AH	(*(volatile unsigned char *)0xA9) /* m/m */
#define OCR4AL	(*(volatile unsigned char *)0xA8) /* m/m */
#define OCR4A	(*(volatile unsigned int *)0xA8) /* m/m */
#define ICR4H	(*(volatile unsigned char *)0xA7) /* m/m */
#define ICR4L	(*(volatile unsigned char *)0xA6) /* m/m */
#define ICR4	(*(volatile unsigned int *)0xA6) /* m/m */
#define TCNT4H	(*(volatile unsigned char *)0xA5) /* m/m */
#define TCNT4L	(*(volatile unsigned char *)0xA4) /* m/m */
#define TCNT4	(*(volatile unsigned int *)0xA4) /* m/m */
#define TCCR4C	(*(volatile unsigned char *)0xA2) /* m/m */
#define  FOC4A    7
#define  FOC4B    6
#define  FOC4C    5
#define TCCR4B	(*(volatile unsigned char *)0xA1) /* m/m */
#define  ICNC4    7
#define  ICES4    6
#define  WGM43    4
#define  WGM42    3
#define  CS42     2
#define  CS41     1
#define  CS40     0
#define TCCR4A	(*(volatile unsigned char *)0xA0) /* m/m */
#define  COM4A1   7
#define  COM4A0   6
#define  COM4B1   5
#define  COM4B0   4
#define  COM4C1   3
#define  COM4C0   2
#define  WGM41    1
#define  WGM40    0

/* Timer/Counter5 */
#define OCR5CH	(*(volatile unsigned char *)0x12D) /* m/m */
#define OCR5CL	(*(volatile unsigned char *)0x12C) /* m/m */
#define OCR5C	(*(volatile unsigned int *)0x12C) /* m/m */
#define OCR5BH	(*(volatile unsigned char *)0x12B) /* m/m */
#define OCR5BL	(*(volatile unsigned char *)0x12A) /* m/m */
#define OCR5B	(*(volatile unsigned int *)0x12A) /* m/m */
#define OCR5AH	(*(volatile unsigned char *)0x129) /* m/m */
#define OCR5AL	(*(volatile unsigned char *)0x128) /* m/m */
#define OCR5A	(*(volatile unsigned int *)0x128) /* m/m */
#define ICR5H	(*(volatile unsigned char *)0x127) /* m/m */
#define ICR5L	(*(volatile unsigned char *)0x126) /* m/m */
#define ICR5	(*(volatile unsigned int *)0x126) /* m/m */
#define TCNT5H	(*(volatile unsigned char *)0x125) /* m/m */
#define TCNT5L	(*(volatile unsigned char *)0x124) /* m/m */
#define TCNT5	(*(volatile unsigned int *)0x124) /* m/m */
#define TCCR5C	(*(volatile unsigned char *)0x122) /* m/m */
#define  FOC5A    7
#define  FOC5B    6
#define  FOC5C    5
#define TCCR5B	(*(volatile unsigned char *)0x121) /* m/m */
#define  ICNC5    7
#define  ICES5    6
#define  WGM53    4
#define  WGM52    3
#define  CS52     2
#define  CS51     1
#define  CS50     0
#define TCCR5A	(*(volatile unsigned char *)0x120) /* m/m */
#define  COM5A1   7
#define  COM5A0   6
#define  COM5B1   5
#define  COM5B0   4
#define  COM5C1   3
#define  COM5C0   2
#define  WGM51    1
#define  WGM50    0

/* Oscillator Calibration Register */
#define OSCCAL	(*(volatile unsigned char *)0x66) /* m/m */

